Revit 2024 API
BuiltInFailures.SketchFailures.SketchingInTheWrongView Property
 Detail sketch is only editable in [View Type].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchingInTheWrongView { get; }
Visual Basic
Public Shared ReadOnly Property SketchingInTheWrongView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchingInTheWrongView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace